[
  {
    "id_ref": "aw_ber_ngtb",
    "title": "Bertelsmann Next Generation Tech Booster Scholarship",
    "date": "Dec 09, 2024",
    "short_description": "Next Generation Tech Booster Scholarship (Phase 1) from Bertelsmann for a Udacity Nanodegree program, valued over $1,500 · Oct 2024",
    "issuer_organization": "Bertelsmann",
    "associated_organization": "Bertelsmann and Udacity",
    "description_full": "This scholarship, offered by Bertelsmann in collaboration with Udacity, aims to support emerging tech professionals. In 2023, I was selected for Phase 1 to pursue the Enterprise Security Nanodegree but was not shortlisted for Phase 2. In 2024, I was again selected, this time for the Foundations of Generative AI Nanodegree. The scholarship covered a program worth over $1,500. Completion of the course included a Certification Assessment (CA) which determined eligibility for Phase 2 and awarded a certificate of completion.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_awsaiml",
    "title": "AWS AI/ML Scholarship",
    "date": "Apr 23, 2024",
    "short_description": "AWS AI/ML Scholarships (Phases 1 & 2) to pursue two Udacity Nanodegree programs valued at over $8,000 · Feb 2024 & Oct 2023",
    "issuer_organization": "Amazon Web Services (AWS)",
    "associated_organization": "AWS and Udacity",
    "description_full": "The AWS AI/ML Scholarship, offered in partnership with Udacity, supports learners interested in applying artificial intelligence and machine learning using AWS technologies. I was awarded both Phase 1 and Phase 2 of this scholarship, enabling me to pursue two separate Nanodegree programs with a combined value of over $8,000. Phase 1 selected the top 2,000 global applicants, while Phase 2 shortlisted the top 500 performers.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_cotutellest",
    "title": "Cotutelle Studentship",
    "date": "Jan. 15, 2023",
    "short_description": "Cotutelle (joint) Studentship as part of the joint doctoral program at Deakin and Coventry University · (Ongoing)",
    "issuer_organization": "Coventry University, Coventry, UK",
    "associated_organization": "Coventry University, Coventry, UK",
    "description_full": "Awarded as part of the joint Ph.D. program between Deakin University, Australia and Coventry University, UK, this studentship provides comprehensive support including return airfare, tuition fees, health insurance, and a living stipend for the research duration at Coventry University.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_duprs",
    "title": "DUPR Scholarship",
    "date": "Jan. 15, 2023",
    "short_description": "Fullly funded DUPR Scholarship for Joint PhD research at Deakin and Coventry University · (Ongoing)",
    "issuer_organization": "Deakin University, Melbourne, Australia",
    "associated_organization": "Deakin University, Melbourne, Australia",
    "description_full": "The Deakin University Postgraduate Research Scholarship (DUPRS) supports my joint doctoral study with Coventry University. The scholarship includes full tuition coverage, health insurance, and a living stipend during the study period at Deakin University",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_dubestpres",
    "title": "Best Presentation Award",
    "date": "Dec. 19, 2021",
    "short_description": "Annual School Conference - School of IT, Deakin University · Dec 2021",
    "issuer_organization": "School of IT, Deakin University, Melbourne, Australia",
    "associated_organization": "Deakin University, Melbourne, Australia",
    "description_full": "Received this award for delivering the best presentation at the Annual School Conference organized by the School of IT, Deakin University in 2021. The recognition included a prize of AUD 200.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_bdbstf",
    "title": "Science and Technology Fellowship (STF)",
    "date": "Feb. 21, 2020",
    "short_description": "Fully funded fellowship for higher education - STF Trust, Ministry of Science and Technology, Bangladesh · Feb 2020",
    "issuer_organization": "STF Trust, Ministry of Science and Technology, Bangladesh",
    "associated_organization": "Deakin University, Melbourne, Australia",
    "description_full": "The Science and Technology Fellowship (STF), awarded by the Ministry of Science and Technology in Bangladesh, supports postgraduate study in information technology at globally recognized institutions. Initially awarded for studies at Wageningen University, the fellowship was redirected toward my studies at Deakin University, Australia.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_aapbdbestemp",
    "title": "Best Employee Award",
    "date": "Jul 15, 2014",
    "short_description": "Best employee of year 2014 - Advanced Apps Bangladesh (AAPBD) Ltd., Bangladesh · Jul 2014",
    "issuer_organization": "Advanced Apps Bangladesh (AAPBD) Ltd., Dhaka, Bangladesh",
    "associated_organization": "Advanced Apps Bangladesh (AAPBD) Ltd., Dhaka, Bangladesh",
    "description_full": "Recognized as the Best Employee of the Year (2014) at Advanced Apps Bangladesh (AAPBD) Ltd. for exceptional contributions in software development, application testing, project coordination, client liaison, and team leadership.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_saucountrytop",
    "title": "Country Topper (Bangladesh)",
    "date": "Apr 23, 2013",
    "short_description": "Post-graduation Entrance Exam - South Asian University (SAU), New Dehli, India · Apr 2013",
    "issuer_organization": "South Asian University (SAU), New Dehli, India",
    "associated_organization": "",
    "description_full": "Achieved the top rank from Bangladesh in the entrance exam for the Master's in Computer Science program at South Asian University (SAU), New Dehli. Only the top three students from each South Asian country were selected under the regional quota system.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_hstubsctop",
    "title": "Undergraduate Department Topper",
    "date": "Mar 2, 2012",
    "short_description": "First Place from the undergrad batch (CSE) - HSTU, Bangladesh · Mar 2012",
    "issuer_organization": "Hajee Mohammad Danesh University of Science and Technology University (HSTU), Dinajpur-5200, Bangladesh",
    "associated_organization": "Hajee Mohammad Danesh University of Science and Technology University (HSTU), Dinajpur-5200, Bangladesh",
    "description_full": "Secured first place in the undergraduate Computer Science and Engineering batch of 35 students at Hajee Mohammad Danesh Science and Technology University (HSTU). Maintained consistent academic excellence across eight semesters.",
    "image_path": "",
    "award_link": ""
  },
  {
    "id_ref": "aw_hstuiupc2009champ",
    "title": "InUPC Champion",
    "date": "Feb. 16, 2009",
    "short_description": "Intra-University Programming Contest (InUPC) Champion - HSTU, Bangladesh · Feb 2009",
    "issuer_organization": "Hajee Mohammad Danesh University of Science and Technology University (HSTU), Dinajpur-5200, Bangladesh",
    "associated_organization": "Hajee Mohammad Danesh University of Science and Technology University (HSTU), Dinajpur-5200, Bangladesh",
    "description_full": "Became the champion of the Intra-University Programming Contest (InUPC) held during HSTU IT Fest 2009. Competed as part of a three-member team while pursuing a B.Sc. in Computer Science and Engineering at HSTU.",
    "image_path": "",
    "award_link": ""
  }
]