{
  "section_info": {
    "title": "Projects_XX",
    "details": "_XXProjects and professional engagements related to research and development.",
    "icon_class": "bx bx-bulb" 
  },
  "projects": [
    {
      "id_ref": "prj_ducuphdres",
      "title": "_XXA MACHINE LEARNING BASED ANALYSIS OF SLEEP PATTERNS IN AGING USING PHYSIOLOGICAL SIGNALS",
      "role": "Graduate Researcher_XX",
      "basic_details": "PhD Cotutelle Research_XX",
      "organization": "_XXDeakin University, Coventry University",
      "timeframe_details": "Jan. 1, 2023 - Present (ongoing)",
      "short_description": "_XXInvestigating the relationship between sleep dynamics (Hypnogram) and healthy ageing using interpretable machine learning models.",
      "long_description": "_XXThis ongoing PhD research focuses on leveraging machine learning techniques to investigate age-related variations in sleep dynamics using physiological signals such as EEG, ECG, and PPG. The study aims to identify discriminative features and biomarkers that can assist in understanding sleep degradation with aging, enabling early detection and intervention for sleep-related disorders in elderly populations.",
      "funding": "Cotutelle program studentship_XX",
      "funding_organization": "_XXCentre for Computational Science and Mathematical Modelling (CSM), Coventry University, United Kingdom",
      "collaboration_organization": "_XXCoventry University (UK), Deakin University (Austrlia)",
      "image_path": "assets/img/organisation/dc.png",
      "url_link": ""
    },
    {
      "id_ref": "prj_duaqp",
      "title": "_XXAir Quality Prediction (Temperature Prediction) for Indoor Environments in Different Cities of Australia.",
      "role": "Research Assistant_XX",
      "basic_details": "ARC Collaboration Research_XX",
      "organization": "_XXMonash University, AETMOS Australia",
      "timeframe_details": "Mar. 1, 2022 - Feb. 28, 2023 (Phase 1 Completed)",
      "short_description": "_XXPrediction of indoor air temperature and quality metrics using meteorological data and deep ensemble machine learning models.",
      "long_description": "_XXContributed as a Research Assistant to a MAAP linkage project funded by the Australian Research Council. This project involved collaboration with Monash University and AETMOS, focusing on predicting indoor air temperature and air quality using meteorological data. The work explored deep learning architectures to evaluate health impacts of environmental conditions, and proposed predictive models for smart urban sustainability.",
      "funding": "ARC MAAP linkage project fund_XX",
      "funding_organization": "_XXAustralian Research Council (ARC)",
      "collaboration_organization": "_XXDeakin University (Austrlia), Monash University (Australia), AETMOS (Australia)",
      "image_path": "assets/img/organisation/dma.png",
      "url_link": "#publications"
    },
    {
      "id_ref": "prj_duamdszicu",
      "title": "Channel minimisation and epileptic seizure detection using single channels using Deep Learning from continuous iEEG of ICU patients.",
      "role": "Research Assistant_XX",
      "basic_details": "Industry Collaboration Research_XX",
      "organization": "Monash University, Alfred Health",
      "timeframe_details": "Apr. 1, 2020 - Mar. 31, 2022 (Phase1 Completed)",
      "short_description": "Channel minimisation and epileptic seizure detection using single channels using Deep Learning from continuous iEEG of ICU patients.",
      "long_description": "This voluntary research focused on minimizing the number of EEG channels required for accurate epileptic seizure detection. Leveraging deep learning on continuous iEEG signals, the study aimed to optimize detection performance while reducing computational and clinical complexity, contributing to more accessible and efficient seizure monitoring systems.",
      "funding": "No funding. This is a voluntary collaboration research work.",
      "funding_organization": "",
      "collaboration_organization": "Deakin University (Austrlia), Monash University (Australia), Alfred Health (Australia)",
      "image_path": "assets/img/organisation/amd.png",
      "url_link": ""
    },
    {
      "id_ref": "prj_irthstu3lnp",
      "title": "DESIGNING A 3-LAYER NETWORK SECURITY TECHNIQUE IN SERVERS FOR PREVENTION OF DDOS ATTACK.",
      "role": "Project Research Associate_XX",
      "basic_details": "University Internal Research_XX",
      "organization": "HSTU - Institute of Research and Technology (IRT)",
      "timeframe_details": "Jul. 1, 2018 - Jun. 30, 2019",
      "short_description": "DESIGNING A 3-LAYER NETWORK SECURITY TECHNIQUE IN SERVERS FOR PREVENTION OF DDOS ATTACK.",
      "long_description": "This project proposed a novel three-layered security framework to mitigate DDoS attacks targeting server infrastructures. The system design integrated preventive, detection, and response mechanisms to enhance cybersecurity resilience and ensure uninterrupted service availability. The project was funded by HSTU through the IRT Annual Research Grant.",
      "funding": "IRT Annual Research Fund",
      "funding_organization": "Institute of Research and Training (IRT), Hajee Mohammad Danesh Science and Technology University (HSTU), Dinajpur-5200, Bangladesh.",
      "collaboration_organization": "",
      "image_path": "assets/img/organisation/hstu.png",
      "url_link": ""
    },
    {
      "id_ref": "prj_irthstubsmnat",
      "title": "_XXANALYSIS AND DESIGN OF A NON-INVASIVE WAY OF MEASURING AND MONITORING BLOOD-SODIUM CONCENTRATION LEVEL USING NEAR-INFRARED SPECTROSCOPY.",
      "role": "Project Research Associate_XX",
      "basic_details": "University Internal Research_XX",
      "organization": "HSTU - Institute of Research and Technology (IRT)_XX",
      "timeframe_details": "Jul. 1, 2018 - Jun. 30, 2019",
      "short_description": "_XXANALYSIS AND DESIGN OF A NON-INVASIVE WAY OF MEASURING AND MONITORING BLOOD-SODIUM CONCENTRATION LEVEL USING NEAR-INFRARED SPECTROSCOPY.",
      "long_description": "_XXThis project explored the feasibility of developing a non-invasive technique to monitor blood sodium concentration using near-infrared spectroscopy. The research involved signal processing, optical modeling, and preliminary prototype design to assess potential applications in real-time clinical diagnostics. It was supported by HSTU’s IRT Annual Research Fund.",
      "funding": "IRT Annual Research Fund_XX",
      "funding_organization": "_XXInstitute of Research and Training (IRT), Hajee Mohammad Danesh Science and Technology University (HSTU), Dinajpur-5200, Bangladesh.",
      "collaboration_organization": "",
      "image_path": "assets/img/organisation/hstu.png",
      "url_link": ""
    }
  ]
}